# CTS Scenario settings: 


# CTS constraints: 
# Clock tree references 
set_lib_cell_purpose -exclude cts [get_lib_cells]
set gcts_cells {*/SAEDRVT14_AOBUF_IW_0P75 */SAEDRVT14_AOBUF_IW_1P5 */SAEDRVT14_AOBUF_IW_3 */SAEDRVT14_AOBUF_IW_6 */SAEDRVT14_AOINV_IW_0P5 */SAEDRVT14_AOINV_IW_1 */SAEDRVT14_AOINV_IW_2 */SAEDRVT14_AOINV_IW_4 */SAEDRVT14_AOINV_IW_6 */SAEDRVT14_BUF_1 */SAEDRVT14_BUF_10 */SAEDRVT14_BUF_12 */SAEDRVT14_BUF_16 */SAEDRVT14_BUF_1P5 */SAEDRVT14_BUF_2 */SAEDRVT14_BUF_20 */SAEDRVT14_BUF_3 */SAEDRVT14_BUF_4 */SAEDRVT14_BUF_6 */SAEDRVT14_BUF_8 */SAEDRVT14_BUF_CDC_2 */SAEDRVT14_BUF_CDC_4 */SAEDRVT14_BUF_ECO_1 */SAEDRVT14_BUF_ECO_2 */SAEDRVT14_BUF_ECO_3 */SAEDRVT14_BUF_ECO_4 */SAEDRVT14_BUF_ECO_6 */SAEDRVT14_BUF_ECO_7 */SAEDRVT14_BUF_ECO_8 */SAEDRVT14_BUF_PECO_1 */SAEDRVT14_BUF_PECO_12 */SAEDRVT14_BUF_PECO_2 */SAEDRVT14_BUF_PECO_4 */SAEDRVT14_BUF_PECO_8 */SAEDRVT14_BUF_PS_0P75 */SAEDRVT14_BUF_PS_1P5 */SAEDRVT14_BUF_PS_6 */SAEDRVT14_BUF_S_0P5 */SAEDRVT14_BUF_S_0P75 */SAEDRVT14_BUF_S_1 */SAEDRVT14_BUF_S_10 */SAEDRVT14_BUF_S_12 */SAEDRVT14_BUF_S_16 */SAEDRVT14_BUF_S_1P5 */SAEDRVT14_BUF_S_2 */SAEDRVT14_BUF_S_20 */SAEDRVT14_BUF_S_3 */SAEDRVT14_BUF_S_4 */SAEDRVT14_BUF_S_6 */SAEDRVT14_BUF_S_8 */SAEDRVT14_BUF_UCDC_0P5 */SAEDRVT14_BUF_UCDC_1 */SAEDRVT14_BUF_U_0P5 */SAEDRVT14_BUF_U_0P75 */SAEDRVT14_DEL_L4D100_1 */SAEDRVT14_DEL_L4D100_2 */SAEDRVT14_DEL_PR2V2_1 */SAEDRVT14_DEL_R2V1_1 */SAEDRVT14_DEL_R2V1_2 */SAEDRVT14_DEL_R2V2_1 */SAEDRVT14_DEL_R2V2_2 */SAEDRVT14_DEL_R2V3_1 */SAEDRVT14_DEL_R2V3_2 */SAEDRVT14_INV_0P5 */SAEDRVT14_INV_0P75 */SAEDRVT14_INV_1 */SAEDRVT14_INV_10 */SAEDRVT14_INV_12 */SAEDRVT14_INV_16 */SAEDRVT14_INV_1P5 */SAEDRVT14_INV_2 */SAEDRVT14_INV_20 */SAEDRVT14_INV_3 */SAEDRVT14_INV_4 */SAEDRVT14_INV_6 */SAEDRVT14_INV_8 */SAEDRVT14_INV_ECO_1 */SAEDRVT14_INV_ECO_2 */SAEDRVT14_INV_ECO_3 */SAEDRVT14_INV_ECO_4 */SAEDRVT14_INV_ECO_6 */SAEDRVT14_INV_ECO_8 */SAEDRVT14_INV_PECO_1 */SAEDRVT14_INV_PECO_12 */SAEDRVT14_INV_PECO_2 */SAEDRVT14_INV_PECO_4 */SAEDRVT14_INV_PECO_8 */SAEDRVT14_INV_PS_1 */SAEDRVT14_INV_PS_2 */SAEDRVT14_INV_PS_3 */SAEDRVT14_INV_PS_6 */SAEDRVT14_INV_S_0P5 */SAEDRVT14_INV_S_0P75 */SAEDRVT14_INV_S_1 */SAEDRVT14_INV_S_10 */SAEDRVT14_INV_S_12 */SAEDRVT14_INV_S_16 */SAEDRVT14_INV_S_1P5 */SAEDRVT14_INV_S_2 */SAEDRVT14_INV_S_20 */SAEDRVT14_INV_S_3 */SAEDRVT14_INV_S_4 */SAEDRVT14_INV_S_5 */SAEDRVT14_INV_S_6 */SAEDRVT14_INV_S_7 */SAEDRVT14_INV_S_8 */SAEDRVT14_INV_S_9 }
set_lib_cell_purpose -include cts [ get_lib_cells $gcts_cells ]
set_dont_touch [ get_lib_cells $gcts_cells ] false
# Clock specific max_trans constraints
set_max_transition 0.5 -clock_path ideal_clock1

# Clock specific max_cap constraints
set_max_capacitance 600 -clock_path ideal_clock1

# max_fanout constraint
set_app_options -name {cts.common.max_fanout} -value 2000
# Clock tree exceptions
# Exceptions on pins
# Exceptions on cells
# Exceptions on nets
# Target latency constraint
set_clock_tree_options -target_latency 0
set_clock_tree_options -target_latency 0 -clock ideal_clock1
# Target skew constraint
set_clock_tree_options -target_skew 0
# Routing rules
set_app_options -name {cts.placement.cell_spacing_rule_style} -value cumulative
#Detailed routed nets
